content/r_rabbit_hole.org
#+Title: The R Rabbit Hole
#+Author: Tyler Burns
#+Date: January 19, 2025 - January 19, 2025

[[./index.html][Home]]

-----
/I almost wish I hadn't gone down that rabbit-hole—and yet—and yet—it's rather curious, you know, this sort of life!/

Lewis Carroll, Alice's Adventures in Wonderland
-----

** From R to S

Let's begin with a simple expression in R. Adding two numbers together.

#+begin_src R :exports both :results output
5 + 2
#+end_src

#+RESULTS:
: [1] 7

Now what we are going to do is ask the simple question: what is actually happening under the hood here? In my Advanced R class that I took around 2016, I learned that R uses an old concept called S-expressions, or symbolic expressions. The way this works is you have a list whereby the first element is a function, followed by the function arguments.

We know of this in the form:
function(arg1, arg2, ...)

But here with "+" we can actually express this in the same format and we will get the same result. Directly in R. You just have to put back ticks around the operator. Try it yourself.

#+begin_src R :exports both :results output
`+`(5, 2)
#+end_src

#+RESULTS:
: [1] 7

It turns out that R will internally parse 5 + 2 into the S-expression above. That is how 5 + 2 is actually represented behind the scenes in R.

S-expressions are a hallmark of an even older programming language called LISP (something Emacs users will still be famililar with today). If we want to see what S-expressions look like in this regard, consider the following LISP code below:

#+begin_src elisp :exports both
(+ 5 2)
#+end_src

#+RESULTS:
: 7

You can see that it's an S-expression, like the one we made in R, but using parentheses. S-expressions can get pretty gnarly looking to the untrained eye. Let's say I wanted to do something like this:

2 * (5 + 2)

Which equals 14.

What that looks like as an S-expression is something like this, in LISP:

#+begin_src elisp :exports both
(* 2 (+ 5 2))
#+end_src

#+RESULTS:
: 14

And lets say we wanted to divide the resulting answer by 7, which would give us 2. We have, in LISP:

#+begin_src elisp :exports both
(/ (* 2 (+ 5 2)) 7)
#+end_src

#+RESULTS:
: 2

So you can imagine if you want to in turn take this product and do something else with it, and so forth, you will end up with parentheses wrapped in parentheses, and so forth. LISP programmers are used to it, and it is a bit of a [[https://xkcd.com/297/][running joke]].

But here's the rub: R operates like this too. Let me show you. Below is R, not LISP. Again, try this yourself:

#+begin_src R :exports both :results output
`/`(`*`(2, `+`(5, 2)), 7)
#+end_src

#+RESULTS:
: [1] 2

So now you can see objectively that R's arithmetic is using S-expressions, the way you would otherwise do in LISP.

