public/r_rabbit_hole.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The R Rabbit Hole</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="simple.css" />
</head>
<body>
<div id="preamble" class="status">
<div style="position: fixed; top: 10px; right: 10px;">
         <button class="toggle-theme-btn" onclick="toggleDarkMode()">Light/Dark</button>
       </div>
</div>
<div id="content" class="content">
<h1 class="title">The R Rabbit Hole</h1>
<p>
<a href="./index.html">Home</a>
</p>

<hr />
<p>
<i>I almost wish I hadn't gone down that rabbit-hole—and yet—and yet—it's rather curious, you know, this sort of life!</i>
</p>

<p>
Lewis Carroll, Alice's Adventures in Wonderland
</p>
<hr />

<div id="outline-container-org0a0b8b3" class="outline-2">
<h2 id="org0a0b8b3">From R to S</h2>
<div class="outline-text-2" id="text-org0a0b8b3">
<p>
What happens under the hood when we do simple arithmetic in R? Let's begin with a simple expression. Adding two numbers together.
</p>

<div class="org-src-container">
<pre class="src src-R">5 + 2
</pre>
</div>

<pre class="example">
[1] 7
</pre>


<p>
Now what we are going to do is ask the simple question: what is actually happening under the hood here? In my Advanced R class that I took around 2016, I learned that R uses an old concept called S-expressions, or symbolic expressions. The way this works is you have a list whereby the first element is a function, followed by the function arguments.
</p>

<p>
We know of this in the form:
function(arg1, arg2, &#x2026;)
</p>

<p>
But here with "+" we can actually express this in the same format and we will get the same result. Directly in R. You just have to put back ticks around the operator. Try it yourself.
</p>

<div class="org-src-container">
<pre class="src src-R">`+`(5, 2)
</pre>
</div>

<pre class="example">
[1] 7
</pre>


<p>
It turns out that R will internally parse 5 + 2 into the S-expression above. That is how 5 + 2 is actually represented behind the scenes in R.
</p>

<p>
S-expressions are a hallmark of an even older programming language called LISP (something Emacs users will still be famililar with today). If we want to see what S-expressions look like in this regard, consider the following LISP code below:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(+ 5 2)
</pre>
</div>

<pre class="example">
7
</pre>


<p>
You can see that it's an S-expression, like the one we made in R, but using parentheses. S-expressions are a completely different notation than we are used to, so they can be difficult to read at first. Let's say I wanted to do something like this:
</p>

<p>
2 * (5 + 2)
</p>

<p>
Which equals 14.
</p>

<p>
What that looks like as an S-expression is something like this, in LISP:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(* 2 (+ 5 2))
</pre>
</div>

<pre class="example">
14
</pre>


<p>
And lets say we wanted to divide the resulting answer by 7, which would give us 2. We have, in LISP:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(/ (* 2 (+ 5 2)) 7)
</pre>
</div>

<pre class="example">
2
</pre>


<p>
So you can imagine if you want to in turn take this product and do something else with it, and so forth, you will end up with parentheses wrapped in parentheses, and so forth. LISP programmers are used to it, and it is a bit of a <a href="https://xkcd.com/297/">running joke</a>.
</p>

<p>
But here's the rub: R operates like this too. Let me show you. Below is R, not LISP. Again, try this yourself:
</p>

<div class="org-src-container">
<pre class="src src-R">`/`(`*`(2, `+`(5, 2)), 7)
</pre>
</div>

<pre class="example">
[1] 2
</pre>


<p>
So now you can see objectively that R's arithmetic is using S-expressions, the way you would otherwise do in LISP.
</p>
</div>
</div>
