content/r_rabbit_hole.org
** From S to C

Ok, this is all well and good, but how do I know that R specifically has S-expressions in mind? In order to answer that, we can download the [[https://cran.r-project.org/src/base/R-4/][source code]] of the R programming language and have a look at it. We can see if any S-expressions are explicitly declared here. Below is the source code from R 4.4.0.

The directory looks like this:

#+begin_src
  drwxr-xr-x  27 tylerburns staff  864 Apr 24  2024 doc
  drwxr-xr-x   8 tylerburns staff  256 Apr 24  2024 etc
  drwxr-xr-x  19 tylerburns staff  608 Apr 24  2024 m4
  drwxr-xr-x   7 tylerburns staff  224 Mar 27  2024 po
  drwxr-xr-x  12 tylerburns staff  384 Apr 24  2024 share
  drwxr-xr-x  13 tylerburns staff  416 Apr 24  2024 src
  drwxr-xr-x 129 tylerburns staff 4.1K Apr 24  2024 tests
  drwxr-xr-x  24 tylerburns staff  768 Apr 24  2024 tools
  -rw-r--r--   1 tylerburns staff  18K Sep 25  2018 COPYING
  -rw-r--r--   1 tylerburns staff  210 Sep 25  2018 ChangeLog
  -rw-r--r--   1 tylerburns staff 1.8K Sep 25  2018 INSTALL
  -rw-r--r--   1 tylerburns staff 5.4K Mar 24  2023 Makeconf.in
  -rw-r--r--   1 tylerburns staff 7.1K Mar 25  2022 Makefile.fw
  -rw-r--r--   1 tylerburns staff  11K Mar 27  2024 Makefile.in
  -rw-r--r--   1 tylerburns staff 4.1K Sep 25  2018 README
  -rw-r--r--   1 tylerburns staff   46 Apr 24  2024 SVN-REVISION
  -rw-r--r--   1 tylerburns staff    6 Apr 24  2024 VERSION
  -rw-r--r--   1 tylerburns staff   10 Apr 10  2024 VERSION-NICK
  -rw-r--r--   1 tylerburns staff  19K Mar 27  2024 config.site
  -rwxr-xr-x   1 tylerburns staff 1.7M Apr 24  2024 configure
  -rw-r--r--   1 tylerburns staff 104K Mar 27  2024 configure.ac
  -rw-r--r--   1 tylerburns staff  356 Mar 24  2023 configure.patch
#+end_src

From here, you're going to go into src. And then main. The first observation is that a whole lot of this is written in C. Here is a slice of the "main" directory:

#+begin_src
-rw-r--r--   1 tylerburns staff 8.0K Mar 27  2024 CommandLineArgs.c
  -rw-r--r--   1 tylerburns staff 8.4K Mar 27  2024 Makefile.in
  -rw-r--r--   1 tylerburns staff 2.8K Mar 27  2024 Makefile.win
  -rw-r--r--   1 tylerburns staff 1.3K Sep 25  2018 RBufferUtils.h
  -rw-r--r--   1 tylerburns staff  27K Mar 27  2024 RNG.c
  -rw-r--r--   1 tylerburns staff 1.9K Mar 29  2019 Rcomplex.h
  -rw-r--r--   1 tylerburns staff  51K Mar 27  2024 Rdynload.c
  -rw-r--r--   1 tylerburns staff  13K Mar 27  2024 Renviron.c
  -rw-r--r--   1 tylerburns staff 1.3K Sep 25  2018 Rmain.c
  -rw-r--r--   1 tylerburns staff  34K Mar 24  2023 Rstrptime.h
  -rw-r--r--   1 tylerburns staff  25K Mar 27  2024 agrep.c
  -rw-r--r--   1 tylerburns staff  14K Sep 25  2018 alloca.c
  -rw-r--r--   1 tylerburns staff  59K Mar 27  2024 altclasses.c
  -rw-r--r--   1 tylerburns staff  34K Mar 24  2023 altrep.c
  -rw-r--r--   1 tylerburns staff  14K Mar 27  2024 apply.c
  -rw-r--r--   1 tylerburns staff  65K Mar 27  2024 arithmetic.c
  -rw-r--r--   1 tylerburns staff 3.5K Mar 25  2022 arithmetic.h
  -rw-r--r--   1 tylerburns staff  64K Mar 27  2024 array.c
  -rw-r--r--   1 tylerburns staff  58K Mar 27  2024 attrib.c
  -rw-r--r--   1 tylerburns staff 1.1K Sep 25  2018 basedecl.h
#+end_src

Notice the .c and .h files. These are both associated with the C programming language. We note here that C is a lower level language. It is much more verbose than what you see in R (or python for that matter), and you have to worry about a lot of things that get swept under the rug in R (like memory management) but it runs much faster.

If we then go into the file arithmetic.c, we find the place the addition operator is defined. The code below is C:

#+begin_src C :eval no
attribute_hidden SEXP do_arith(SEXP call, SEXP op, SEXP args, SEXP env)
#+end_src

Where this function takes care of many of the arithmetic operations. The SEXP means S-expression. The "op" is the operator of interest, which is +, -, *, or /.

Within this function, we can find a switch statement (think of this as an if statement across multiple cases), where the operators and actions are defined. Again, this is C:

#+begin_src C :eval no
switch (PRIMVAL(op)) {
	case PLUSOP: SET_SCALAR_DVAL(ans, x1 + x2); return ans;
	case MINUSOP: SET_SCALAR_DVAL(ans, x1 - x2); return ans;
	case TIMESOP: SET_SCALAR_DVAL(ans, x1 * x2); return ans;
	case DIVOP: SET_SCALAR_DVAL(ans, x1 / x2); return ans;
}
#+end_src

Where you can see that "+" is PLUSOP, where x1 + x2 is defined.

