content/r_rabbit_hole.org
** From C to Assembly

So we started with 5 + 2 and now we are looking at an obscure switch statement in C. But if it is written in C, that means it is indirectly written in something deeper: machine code.

C code compiles down to what is known as machine code, which is the zeros and ones that allow the program to execute. There is a human-readable representation of machine code called Assembly that allows one to actually read and understand what is going on, with proper training.

In order for us to understand what is going on there, let's go ahead and return to 5 + 2, but write it in C. I note that below I am using a literate programming environment to run C, and the standard way to do it is to make a c script (eg. add_two_numbers.c) and then compile it using a tool like gcc or clang, depending on what kind of computer you have. But anyway, here is the C code and its execution:

#+begin_src C :exports both :results output
#include <stdio.h>

int main() {
    printf("%d", 5 + 2);
    return 0;
}
#+end_src

#+RESULTS:
: 7

We did a simple arithmetic operation. Add two numbers together and print it. "int main" is similar to "def main" in python. "printf" is the C way of printing, where you declare what data type you are printing ("%d" is going to be an integer), and then what you're printing. Here, C adds 5 and 2 and then prints it.

Then it returns 0, which is a way of explicitly saying "exit the program." Exiting with 0 indicates that the program ran successfully, by convention. R does this too under the hood, but it is not something that the user has to worry about.

Anyway, we have looked at C, but what is actually happening in Assembly?

To answer that question, we will go ahead and print out the Assembly code associated with the function, and have a look at it. It is going to be really complicated looking but we will just look at a few pieces of it so you can have a feel for what is going on here.

We do this in the literate programming environment we have here by running the following shell script, which takes the code we wrote above and prints out the assembly.

#+begin_src shell :eval no
echo '#include <stdio.h>
int main() {
    printf("%d", 5 + 2);
    return 0;
}' > temp.c
gcc -S -o temp.s -fno-asynchronous-unwind-tables -fno-verbose-asm -O2 temp.c
cat temp.s
#+end_src

Which we then put into another code block to make it a bit less ugly. This is what Assembly looks like. This is the kind of thing being swept under the rug when you do 5 + 2 and print it out. This is going to look messy and you don't have to fully understand it. I just want you to see what it looks like. Note also that the code below is ARM Assembly, because this was made on a MacBook Pro with a M1 architecture. Those who have another architecture, like x86, will have Assembly that looks similar in concept, but has slightly different syntax.

Anyway, here's the Assembly from the C code above:

#+begin_src asm
	.section	__TEXT,__text,regular,pure_instructions
	.build_version macos, 14, 0	sdk_version 14, 2
	.globl	_main
	.p2align	2
_main:
	.cfi_startproc
	sub	sp, sp, #32
	.cfi_def_cfa_offset 32
	stp	x29, x30, [sp, #16]
	add	x29, sp, #16
	.cfi_def_cfa w29, 16
	.cfi_offset w30, -8
	.cfi_offset w29, -16
	mov	w8, #7
	str	x8, [sp]
Lloh0:
	adrp	x0, l_.str@PAGE
Lloh1:
	add	x0, x0, l_.str@PAGEOFF
	bl	_printf
	mov	w0, #0
	ldp	x29, x30, [sp, #16]
	add	sp, sp, #32
	ret
	.loh AdrpAdd	Lloh0, Lloh1
	.cfi_endproc

	.section	__TEXT,__cstring,cstring_literals
l_.str:
	.asciz	"%d"

.subsections_via_symbols
#+end_src

Yes, this is kindof a lot. I get it. Again, you don't have to fully understand it. I just want to zoom in on a few things. The first is that it's basically a recipe. There is a sort of step by step execution taking place. A command followed by some symbols. Similar to the format of the S-expression from earlier:

(function arg1 arg2 ...)

Now let's find 5 + 2. We note that it is pre-computed by the [[https://en.wikipedia.org/wiki/Compiler][compiler]] as an optimization, so the remaining assembly instructions start with the number 7 (I actually didn't expect this...call it learn by doing). Many modern compilers do this, and it's known as [[https://en.wikipedia.org/wiki/Constant_folding][constant folding]].

There are other instances (beyond the scope of this document) where a function called "add" is called directly within Assembly. Below is what happens with the number 7 in our Assembly code:

#+begin_src asm :eval no
    mov w8, #7             ; Equivalent to x <- 5 + 2 in R (precomputed by the compiler)
    str x8, [sp]           ; Store value (7) on the stack
#+end_src

As a quick primer, ARM64 (my computer architecture) has 64-bit memory registers x0 to x30. We can refer to them directly, but if we only want to refer to the lower 32 bits of the registers, we can use w0 to w30 to refer to each of the registers, where the numbers denote the same physical register. So x8 and w8 both are referring to the same physical register. At the time of writing [2025-01-19 Sun], I have not done enough Assembly to tell you when you would refer to "w" versus "x" for a given physical register.

Anyway in this chunk, you have "mov" which is a function that moves the second argument, 7, into a memory register called w8. From there, the value gets stored on the stack, referring to x8, which is valid as we have explained above.

The stack is a region in the computer's memory where local variables can be stored. It is analogous to the "local environment" in R/Python.

From here, the main task is to print it out. Where does that take place? Here:

#+begin_src asm :eval no
    bl _printf ; Call `printf` (similar to calling `print` in R)
#+end_src

And then there is that "return 0" from C that we had seen before. Again, this is an interesting concept whereby you have to explicitly tell the program to stop running, and indicate whether the program ran successfully. A return of 0 indicates that it ran successfully. This is something we don't worry about in R, but it is something that happens under the hood. Below is what is actually happening in Assembly:

#+begin_src asm :eval no
    mov w0, #0             ; Set return value to 0
    ldp x29, x30, [sp]     ; Restore the frame pointer and return address
    add sp, sp, #32        ; Clean up the stack
    ret                    ; Return to the caller (like `return()`
#+end_src

Notice the "mov" function again, where here we are moving the number 0 into another memory register called w0. Again, the exit code of zero is a convention that typically means "no errors."

Ok, wrapping up this section, we can see a few important things. The first is that the lowest level of code, well underneath R, is all a big recipe, where instructions are computed line by line, as explicit as possible, all the way to telling the computer to exit the program and that there was no errors.

Another important thing is that within this recipe, while there are a number of commands, these generally boil down to simple actions, like moving things into registers, running functions like printf, managing memory (the stack in our example), and returning with an exit code.

