public/r_rabbit_hole.html

<div id="outline-container-org8de478d" class="outline-2">
<h2 id="org8de478d">From C to Assembly</h2>
<div class="outline-text-2" id="text-org8de478d">
<p>
So we started with 5 + 2 and now we are looking at an obscure switch statement in C. But if it is written in C, that means it is indirectly written in something deeper: machine code.
</p>

<p>
C code compiles down to what is known as machine code, which is the zeros and ones that allow the program to execute. There is a human-readable representation of machine code called Assembly that allows one to actually read and understand what is going on, with proper training.
</p>

<p>
In order for us to understand what is going on there, let's go ahead and return to 5 + 2, but write it in C. I note that below I am using a literate programming environment to run C, and the standard way to do it is to make a c script (eg. add<sub>two</sub><sub>numbers.c</sub>) and then compile it using a tool like gcc or clang, depending on what kind of computer you have. But anyway, here is the C code and its execution:
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
    printf(<span class="org-string">"%d"</span>, 5 + 2);
    <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<pre class="example">
7
</pre>


<p>
We did a simple arithmetic operation. Add two numbers together and print it. "int main" is similar to "def main" in python. "printf" is the C way of printing, where you declare what data type you are printing ("%d" is going to be an integer), and then what you're printing. Here, C adds 5 and 2 and then prints it.
</p>

<p>
Then it returns 0, which is a way of explicitly saying "exit the program." Exiting with 0 indicates that the program ran successfully, by convention. R does this too under the hood, and this becomes important if you are running R from the command line. The function quit(), which you can read about in the documentation <a href="https://www.rdocumentation.org/packages/base/versions/3.6.2/topics/quit">here</a>, allows you to explicitly exit in R, also retruning an exit code with the same convention of 0 meaning no errors.
</p>

<p>
Anyway, we have looked at C, but what is actually happening in Assembly?
</p>

<p>
To answer that question, we will go ahead and print out the Assembly code associated with the function, and have a look at it. It is going to be really complicated looking but we will just look at a few pieces of it so you can have a feel for what is going on here.
</p>

<p>
We do this in the literate programming environment we have here by running the following shell script, which takes the code we wrote above and prints out the assembly.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">echo</span> <span class="org-string">'#include &lt;stdio.h&gt;</span>
<span class="org-string">int main() {</span>
<span class="org-string">    printf("%d", 5 + 2);</span>
<span class="org-string">    return 0;</span>
<span class="org-string">}'</span> &gt; temp.c
gcc -S -o temp.s -fno-asynchronous-unwind-tables -fno-verbose-asm -O2 temp.c
cat temp.s
</pre>
</div>

<p>
Which we then put into another code block to make it a bit less ugly. This is what Assembly looks like. This is the kind of thing being swept under the rug when you do 5 + 2 and print it out. This is going to look messy and you don't have to fully understand it. I just want you to see what it looks like. Note also that the code below is ARM Assembly, because this was made on a MacBook Pro with a M1 architecture. Those who have another architecture, like x86, will have Assembly that looks similar in concept, but has slightly different syntax.
</p>

<p>
Anyway, here's the Assembly from the C code above:
</p>

<div class="org-src-container">
<pre class="src src-asm">        <span class="org-keyword">.section</span>        __TEXT,__text,regular,pure_instructions
        <span class="org-keyword">.build_version</span> macos, 14, 0     sdk_version 14, 2
        <span class="org-keyword">.globl</span>  _main
        <span class="org-keyword">.p2align</span>        2
<span class="org-function-name">_main</span>:
        <span class="org-keyword">.cfi_startproc</span>
        <span class="org-keyword">sub</span>     sp, sp, #32
        <span class="org-keyword">.cfi_def_cfa_offset</span> 32
        <span class="org-keyword">stp</span>     x29, x30, [sp, #16]
        <span class="org-keyword">add</span>     x29, sp, #16
        <span class="org-keyword">.cfi_def_cfa</span> w29, 16
        <span class="org-keyword">.cfi_offset</span> w30, -8
        <span class="org-keyword">.cfi_offset</span> w29, -16
        <span class="org-keyword">mov</span>     w8, #7
        <span class="org-keyword">str</span>     x8, [sp]
<span class="org-function-name">Lloh0</span>:
        <span class="org-keyword">adrp</span>    x0, l_.str@PAGE
<span class="org-function-name">Lloh1</span>:
        <span class="org-keyword">add</span>     x0, x0, l_.str@PAGEOFF
        <span class="org-keyword">bl</span>      _printf
        <span class="org-keyword">mov</span>     w0, #0
        <span class="org-keyword">ldp</span>     x29, x30, [sp, #16]
        <span class="org-keyword">add</span>     sp, sp, #32
        <span class="org-keyword">ret</span>
        <span class="org-keyword">.loh</span> AdrpAdd    Lloh0, Lloh1
        <span class="org-keyword">.cfi_endproc</span>

        <span class="org-keyword">.section</span>        __TEXT,__cstring,cstring_literals
<span class="org-function-name">l</span>_.str:
        <span class="org-keyword">.asciz</span>  <span class="org-string">"%d"</span>

<span class="org-keyword">.subsections_via_symbols</span>
</pre>
</div>

<p>
Yes, this is kindof a lot. I get it. Again, you don't have to fully understand it. I just want to zoom in on a few things. The first is that it's basically a recipe. There is a sort of step by step execution taking place. A command followed by some symbols. Similar to the format of the S-expression from earlier:
</p>

<p>
(function arg1 arg2 &#x2026;)
</p>

<p>
Now let's find 5 + 2. We note that it is pre-computed by the <a href="https://en.wikipedia.org/wiki/Compiler">compiler</a> as an optimization, so the remaining assembly instructions start with the number 7 (I actually didn't expect this&#x2026;call it learn by doing). Many modern compilers do this, and it's known as <a href="https://en.wikipedia.org/wiki/Constant_folding">constant folding</a>.
</p>

<p>
There are other instances (beyond the scope of this document) where a function called "add" is called directly within Assembly. Below is what happens with the number 7 in our Assembly code:
</p>

<div class="org-src-container">
<pre class="src src-asm"><span class="org-function-name">mov</span> <span class="org-keyword">w8</span>, #7             <span class="org-comment-delimiter">; </span><span class="org-comment">Equivalent to x &lt;- 5 + 2 in R (precomputed by the compiler)</span>
<span class="org-function-name">str</span> <span class="org-keyword">x8</span>, [sp]           <span class="org-comment-delimiter">; </span><span class="org-comment">Store value (7) on the stack</span>
</pre>
</div>

<p>
As a quick primer, ARM64 (my computer architecture) has 64-bit memory registers x0 to x30. We can refer to them directly, but if we only want to refer to the lower 32 bits of the registers, we can use w0 to w30 to refer to each of the registers, where the numbers denote the same physical register. So x8 and w8 both are referring to the same physical register. At the time of writing <span class="timestamp-wrapper"><span class="timestamp">[2025-01-19 Sun]</span></span>, I have not done enough Assembly to tell you when you would refer to "w" versus "x" for a given physical register.
</p>

<p>
Anyway in this chunk, you have "mov" which is a function that moves the second argument, 7, into a memory register called w8. From there, the value gets stored on the stack, referring to x8, which is valid as we have explained above.
</p>

<p>
The stack is a region in the computer's memory where local variables can be stored. It is analogous to the "local environment" in R/Python.
</p>

<p>
From here, the main task is to print it out. Where does that take place? Here:
</p>

<div class="org-src-container">
<pre class="src src-asm"><span class="org-function-name">bl</span> _printf <span class="org-comment-delimiter">; </span><span class="org-comment">Call `printf` (similar to calling `print` in R)</span>
</pre>
</div>

<p>
And then there is that "return 0" from C that we had seen before. Again, this is an interesting concept whereby you have to explicitly tell the program to stop running, and indicate whether the program ran successfully. A return of 0 indicates that it ran successfully. This is something we don't worry about in R, but it is something that happens under the hood. Below is what is actually happening in Assembly:
</p>

<div class="org-src-container">
<pre class="src src-asm"><span class="org-function-name">mov</span> <span class="org-keyword">w0</span>, #0             <span class="org-comment-delimiter">; </span><span class="org-comment">Set return value to 0</span>
<span class="org-function-name">ldp</span> <span class="org-keyword">x29</span>, x30, [sp]     <span class="org-comment-delimiter">; </span><span class="org-comment">Restore the frame pointer and return address</span>
<span class="org-function-name">add</span> <span class="org-keyword">sp</span>, sp, #32        <span class="org-comment-delimiter">; </span><span class="org-comment">Clean up the stack</span>
<span class="org-function-name">ret</span>                    <span class="org-comment-delimiter">; </span><span class="org-comment">Return to the caller (like `return()`</span>
</pre>
</div>

<p>
Notice the "mov" function again, where here we are moving the number 0 into another memory register called w0. Again, the exit code of zero is a convention that typically means "no errors."
</p>

<p>
Ok, wrapping up this section, we can see a few important things. The first is that the lowest level of code, well underneath R, is all a big recipe, where instructions are computed line by line, as explicit as possible, all the way to telling the computer to exit the program and that there was no errors.
</p>

<p>
Another important thing is that within this recipe, while there are a number of commands, these generally boil down to simple actions, like moving things into registers, running functions like printf, managing memory (the stack in our example), and returning with an exit code.
</p>
</div>
</div>
