content/r_rabbit_hole.org
** Conclusion

Ok, let's go back to familiarity now.

#+begin_src R :exports both :results output
5 + 2
#+end_src

#+RESULTS:
: [1] 7

And you can now see just how much is swept under the rug. We started with 5 + 2. We then showed that we could make the equivalent statement as an S-expression and have it successfully run in R. This is because R will parse 5 + 7 into an S-expression internally. We then showed that R's built-in arithmetic functions are written in C. We then looked at the C code behind the S-expression that defines arithmetic operations in R. And from there, we looked at the Assembly code that underlies C.

To summarize as a list:

1. R code (5 + 2) -> internally becomes an S-expression (`+`(5,2)).
2. Arithmetic in R -> implemented in C code.
3. C code -> compiled to machine code, which we can view as Assembly.
4. Assembly -> direct instructions for the CPU: move data into registers, call functions, manage the stack, exit.

What is the point?

What has helped me solve the truly difficult problems, where no one has written the book on the thing, is understanding first principles. This means understanding the concepts that underlie whatever I'm doing. This is similar to how as a biologist, you have to learn chemistry and physics as part of the curriculum.

Similar to here, if you started in R and Python, you should have familiarity with the languages that are lower level, like C (even if it's literally at the level of very basic operations like printing something or writing a simple function). And you should at least know what Assembly looks like and what it generally does.

Be familiar with the full stack. Whatever it is. Go down the rabbit hole, as far as you can. And you will be a better problem solver, able to see the high-level, and able to reason from first principles.

And of course, we can be grateful for the sheer volume of things we don't have to worry about now because of the coders before us, who innovated so we didn't have to worry about analyzing single-cell sequencing data in Assembly.

We truly stand on the shoulders of giants before us.
