public/r_rabbit_hole.html

<div id="outline-container-org5bae261" class="outline-2">
<h2 id="org5bae261">Conclusion</h2>
<div class="outline-text-2" id="text-org5bae261">
<p>
Ok, let's go back to familiarity now.
</p>

<div class="org-src-container">
<pre class="src src-R">5 + 2
</pre>
</div>

<pre class="example">
[1] 7
</pre>


<p>
And you can now see just how much is swept under the rug. We started with 5 + 2. We then showed that we could make the equivalent statement as an S-expression and have it successfully run in R. This is because R will parse 5 + 7 into an S-expression internally. We then showed that R's built-in arithmetic functions are written in C. We then looked at the C code behind the S-expression that defines arithmetic operations in R. And from there, we looked at the Assembly code that underlies C.
</p>

<p>
To summarize as a list:
</p>

<ol class="org-ol">
<li>R code (5 + 2) -&gt; internally becomes an S-expression (`+`(5,2)).</li>
<li>Arithmetic in R -&gt; implemented in C code.</li>
<li>C code -&gt; compiled to machine code, which we can view as Assembly.</li>
<li>Assembly -&gt; direct instructions for the CPU: move data into registers, call functions, manage the stack, exit.</li>
</ol>

<p>
What is the point?
</p>

<p>
What has helped me solve the truly difficult problems, where no one has written the book on the thing, is understanding first principles. This means understanding the concepts that underlie whatever I'm doing. This is similar to how as a biologist, you have to learn chemistry and physics as part of the curriculum.
</p>

<p>
Similar to here, if you started in R and Python, you should have familiarity with the languages that are lower level, like C (even if it's literally at the level of very basic operations like printing something or writing a simple function). And you should at least know what Assembly looks like and what it generally does.
</p>

<p>
Be familiar with the full stack. Whatever it is. Go down the rabbit hole, as far as you can. And you will be a better problem solver, able to see the high-level, and able to reason from first principles.
</p>

<p>
And of course, we can be grateful for the sheer volume of things we don't have to worry about now because of the coders before us, who innovated so we didn't have to worry about analyzing single-cell sequencing data in Assembly.
</p>

<p>
We truly stand on the shoulders of giants before us.
</p>

<hr />

<p>
[1] We note that R has a switch as well, which you can read about in the documentation <a href="https://www.rdocumentation.org/packages/base/versions/3.6.2/topics/switch">here</a>. Note that in R, switch is a function, and not a statement.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: January 19, 2025 - January 20, 2025</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
